Gitlab VS Github VS BitBucket:
- GitHub:
GitHub был запущен в 2008 году. Это платформа для размещения репозиториев на основе git, в настоящее время принадлежащая Microsoft.
В нем размещаются только проекты, использующие Git VCS
Это бесплатно для общедоступных репозиториев, а для частных - платно.
GitHub написан с использованием Ruby и Erlang
В нем есть нечто, называемое Gists (способ обмена фрагментами кода).
Он поставляется со своей собственной вики-страницей и системой отслеживания проблем.
Здесь мы можем решить, получит ли кто-то доступ на чтение или запись к репозиторию.
Это крупнейший репозиторий с более чем 38 миллионами проектов.
Он обеспечивает поддержку онлайнового веб-редактора VS code.
У него есть ограничения по размеру. Размер файла не может превышать 100 Мб, в то время как хранилище может содержать 2 ГБ информации.

Некоторые замечательные особенности GitHub:
1.Историю фиксации можно увидеть
2.Графики: пульс, участники, коммиты, частота кода, его участники.
3.Извлекать запросы с обзором кода и комментариями
4.Отслеживание проблем
5.Уведомления по электронной почте
